In [1]:
from bs4 import BeautifulSoup
import pandas as pd
import requests

In [2]:
page = requests.get('https://sos.ga.gov/elections/election_results/2010_0810/0030701.htm')
soup = BeautifulSoup(page.text, 'html.parser')

In [3]:
table = soup.find_all("table")[2]

In [4]:
df = pd.read_html(str(table), flavor='bs4')

In [5]:
df = df[1]

In [6]:
df.shape

(8, 8)

In [7]:
df.head(5)

         0     1             2                3               4   5   6   7
0      NaN   NaN  Hice  31,426  Woodall  39,987  Totals  71,413 NaN NaN NaN
1      NaN   NaN         44.0%            56.0%          100.0% NaN NaN NaN
2   County   PPR           NaN              NaN             NaN NaN NaN NaN
3   BARROW  100%          3867             2110            5977 NaN NaN NaN
4  FORSYTH  100%           832             1678            2510 NaN NaN NaN

In [8]:
df = df[3:]

In [9]:
df.head(5)

          0     1      2      3      4   5   6   7
3    BARROW  100%   3867   2110   5977 NaN NaN NaN
4   FORSYTH  100%    832   1678   2510 NaN NaN NaN
5  GWINNETT  100%  20642  30933  51575 NaN NaN NaN
6    NEWTON  100%    719    895   1614 NaN NaN NaN
7    WALTON  100%   5366   4371   9737 NaN NaN NaN

In [10]:
df = df[df.columns[[0,2,3]]]

In [11]:
df.head(5)

          0      2      3
3    BARROW   3867   2110
4   FORSYTH    832   1678
5  GWINNETT  20642  30933
6    NEWTON    719    895
7    WALTON   5366   4371

In [12]:
df.columns = ['county', 'Jody Hice', 'Rob Woodall']

In [13]:
df.tail(5)

     county Jody Hice Rob Woodall
3    BARROW      3867        2110
4   FORSYTH       832        1678
5  GWINNETT     20642       30933
6    NEWTON       719         895
7    WALTON      5366        4371

In [14]:
df = df.melt(id_vars=['county'])

In [15]:
df.columns = ['county', 'candidate', 'votes']

In [16]:
df.head()

     county  candidate  votes
0    BARROW  Jody Hice   3867
1   FORSYTH  Jody Hice    832
2  GWINNETT  Jody Hice  20642
3    NEWTON  Jody Hice    719
4    WALTON  Jody Hice   5366

In [17]:
df['votes'] = df['votes'].astype(int)

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
county       10 non-null object
candidate    10 non-null object
votes        10 non-null int64
dtypes: int64(1), object(2)
memory usage: 320.0+ bytes

In [19]:
df['office'] = 'U.S. Representative'

In [20]:
df['district'] = '7'

In [21]:
df['party'] = 'Republican'

In [22]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate    party
Jody Hice    Republican    31426
Rob Woodall  Republican    39987
Name: votes, dtype: int64

In [23]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

     county               office district       party  candidate  votes
0    BARROW  U.S. Representative        7  Republican  Jody Hice   3867
1   FORSYTH  U.S. Representative        7  Republican  Jody Hice    832
2  GWINNETT  U.S. Representative        7  Republican  Jody Hice  20642
3    NEWTON  U.S. Representative        7  Republican  Jody Hice    719
4    WALTON  U.S. Representative        7  Republican  Jody Hice   5366

In [24]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')